# St7GetCreepDefinitionName

Returns the name of the specified creep law definition.

long St7GetCreepDefinitionName(long uID, long CreepID, char* CreepDefinitionName,

long MaxStringLen)

Input Parameters

uID

Strand7 model file ID.

CreepID

Creep layout ID.

MaxStringLen

Maximum number of characters allocated for CreepDefinitionName.

Output Parameters

CreepDefinitionName

Name of the creep definition.